# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  - [-1, 1, Blocks, [64,  BasicBlock, 2, 2, 'relu']]  # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock_REF_Block, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock_REF_Block, 2, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.3
  - [-1, 1, ETB, [8]]                              # 9
  - [-1, 1, GLSA, [256]]                           # 10, Y5(P5)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 11
  - [6, 1, GLSA, [256]]                            # 12 input_proj.2 (P4)
  - [[-2, -1], 1, Concat, [1]]                     # 13
  - [-1, 3, RepC3, [256, 0.5]]                     # 14
  - [-1, 1, GLSA, [256]]                           # 15, Y4(FPN之后)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 16
  - [5, 1, GLSA, [256]]                            # 17 input_proj.1 (P3)
  - [[-2, -1], 1, Concat, [1]]                     # 18
  - [-1, 3, RepC3, [256, 0.5]]                     # 19

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 20
  - [4, 1, GLSA, [128]]                            # 21 input_proj.0 (P2)
  - [[-2, -1], 1, Concat, [1]]                     # 22
  - [-1, 3, RepC3, [128, 0.5]]                     # 23, X2

  - [-1, 1, Conv, [256, 3, 2]]                     # 24
  - [[-1, 19], 1, Concat, [1]]                     # 25
  - [-1, 3, RepC3, [256, 0.5]]                     # 26

  - [-1, 1, Conv, [256, 3, 2]]                     # 27
  - [[-1, 15], 1, Concat, [1]]                     # 28
  - [-1, 3, RepC3, [256, 0.5]]                     # 29

  - [-1, 1, Conv, [256, 3, 2]]                     # 30
  - [[-1, 10], 1, Concat, [1]]                     # 31
  - [-1, 3, RepC3, [256, 0.5]]                     # 32

  - [[23, 26, 29, 32], 1, RTDETRDecoder, [nc, 128, 300, 4, 8, 3]]  # Detect(P2, P3, P4, P5)